## if_then

In [15]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({'AAA':[4,5,6,7],'BBB':[10,20,30,40],'CCC':[100,50,-30,-50]})
df

In [34]:
df[np.any(df.loc[:,:]>50,axis=1)]

   AAA  BBB  CCC
0    4   10  100

In [27]:
df.loc[df.AAA>4,['AAA','CCC']]

   AAA  CCC
1    5   50
2    6  -30
3    7  -50

In [33]:
df.loc[np.any(df.loc[:,:]>50,axis=1),['BBB','CCC']]

   BBB  CCC
0   10  100

In [35]:
df_mask = pd.DataFrame({'AAA' : [True] * 4, 'BBB' : [False] * 4,'CCC' : [True,False] * 2})

In [38]:
df.where(df_mask)

   AAA  BBB    CCC
0    4  NaN  100.0
1    5  NaN    NaN
2    6  NaN  -30.0
3    7  NaN    NaN

In [41]:
df.where(df_mask,66)

   AAA  BBB  CCC
0    4   66  100
1    5   66   66
2    6   66  -30
3    7   66   66

In [54]:
df['zz']=np.where(df.AAA>5,'high','low')
df

   AAA  BBB  CCC    zz
0    4   10  100   low
1    5   20   50   low
2    6   30  -30  high
3    7   40  -50  high

### Splitting

In [56]:
df = pd.DataFrame({'AAA':[4,5,6,7],'BBB':[10,20,30,40],'CCC':[100,50,-30,-50]})
df

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

In [57]:
dflow = df[df.AAA<=5]
dflow

   AAA  BBB  CCC
0    4   10  100
1    5   20   50

In [58]:
dfhigh = df[df.BBB>=20]
dfhigh

   AAA  BBB  CCC
1    5   20   50
2    6   30  -30
3    7   40  -50

### Building Criteria 内建标准

In [59]:
df = pd.DataFrame({'AAA':[4,5,6,7],'BBB':[10,20,30,40],'CCC':[100,50,-30,-50]})
df

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

In [63]:
newseries = df.loc[(df['BBB'] < 25) & (df['CCC'] >= -40),['AAA','CCC'] ]
newseries

   AAA  CCC
0    4  100
1    5   50

In [78]:
newseries = df.loc[(df['BBB'] < 25) | (df['CCC'] >= -40),: ]
newseries

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30

In [76]:
newseries = df.loc[0:,(df.loc[0]>50) | (df.loc[1]>10)]
newseries

   BBB  CCC
0   10  100
1   20   50
2   30  -30
3   40  -50

### 排序

In [80]:
df = pd.DataFrame({'AAA':[4,5,6,7],'BBB':[10,20,30,40],'CCC':[100,50,-30,-50]})
df

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

In [82]:
df.loc[df.CCC.argsort()]

   AAA  BBB  CCC
3    7   40  -50
2    6   30  -30
1    5   20   50
0    4   10  100

In [84]:
value= 20
df.loc[(df.CCC-value).abs().argsort()] # 相减后取绝对值

   AAA  BBB  CCC
1    5   20   50
2    6   30  -30
3    7   40  -50
0    4   10  100

In [89]:
crit1 = df.AAA <=5.5
crit2 = df.BBB >=10
crit3 = df.CCC >-40

In [94]:
AllCrit = crit1 & crit2 & crit3
AllCrit

0     True
1     True
2    False
3    False
dtype: bool

In [97]:
import functools
CritList = [crit1, crit2, crit3]
AllCrit = functools.reduce(lambda x,y: x & y, CritList)
df[AllCrit]

   AAA  BBB  CCC
0    4   10  100
1    5   20   50